/*
Создайте функцию truncate(str, maxlength), 
которая проверяет длину строки str и, если она превосходит maxlength, 
заменяет конец str на "…", так, чтобы её длина стала равна maxlength.

Результатом функции должна быть та же строка, 
если усечение не требуется, либо, если необходимо, усечённая строка.

Например:

truncate("Вот, что мне хотелось бы сказать на эту тему:", 20) = "Вот, что мне хотело…"

truncate("Всем привет!", 20) = "Всем привет!"
*/

// РЕШЕНИЕ
const truncate = function (str, maxlength) {
  // случай, когда усечения не требуется
  if (str.length < maxlength) return str;

  return str.replace(str.slice(maxlength - 1), "…");
};

// тесты в песочнице пройдены
